; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l32_p32_c32_g32_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(at crate25 depot)
	(at crate26 depot)
	(at crate27 depot)
	(at crate28 depot)
	(at crate29 depot)
	(at crate30 depot)
	(at crate31 depot)
	(at crate32 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 medicine)
	(crate-content crate13 medicine)
	(crate-content crate14 medicine)
	(crate-content crate15 medicine)
	(crate-content crate16 medicine)
	(crate-content crate17 medicine)
	(crate-content crate18 medicine)
	(crate-content crate19 medicine)
	(crate-content crate20 medicine)
	(crate-content crate21 medicine)
	(crate-content crate22 medicine)
	(crate-content crate23 medicine)
	(crate-content crate24 medicine)
	(crate-content crate25 medicine)
	(crate-content crate26 medicine)
	(crate-content crate27 medicine)
	(crate-content crate28 medicine)
	(crate-content crate29 medicine)
	(crate-content crate30 medicine)
	(crate-content crate31 medicine)
	(crate-content crate32 medicine)
	(at person1 loc21)
	(at person2 loc9)
	(at person3 loc5)
	(at person4 loc29)
	(at person5 loc20)
	(at person6 loc20)
	(at person7 loc28)
	(at person8 loc16)
	(at person9 loc16)
	(at person10 loc27)
	(at person11 loc18)
	(at person12 loc29)
	(at person13 loc30)
	(at person14 loc13)
	(at person15 loc22)
	(at person16 loc24)
	(at person17 loc30)
	(at person18 loc14)
	(at person19 loc24)
	(at person20 loc25)
	(at person21 loc10)
	(at person22 loc31)
	(at person23 loc29)
	(at person24 loc3)
	(at person25 loc5)
	(at person26 loc16)
	(at person27 loc19)
	(at person28 loc5)
	(at person29 loc9)
	(at person30 loc17)
	(at person31 loc31)
	(at person32 loc2)
	(person-needs person1 medicine)
	(person-needs person2 food)
	(person-needs person2 medicine)
	(person-needs person3 medicine)
	(person-needs person4 medicine)
	(person-needs person5 medicine)
	(person-needs person6 food)
	(person-needs person6 medicine)
	(person-needs person8 medicine)
	(person-needs person9 medicine)
	(person-needs person10 food)
	(person-needs person10 medicine)
	(person-needs person11 medicine)
	(person-needs person12 medicine)
	(person-needs person14 food)
	(person-needs person15 food)
	(person-needs person15 medicine)
	(person-needs person17 medicine)
	(person-needs person18 medicine)
	(person-needs person19 food)
	(person-needs person20 medicine)
	(person-needs person21 food)
	(person-needs person22 medicine)
	(person-needs person23 medicine)
	(person-needs person24 food)
	(person-needs person25 medicine)
	(person-needs person26 medicine)
	(person-needs person27 food)
	(person-needs person29 medicine)
	(person-needs person31 food)
	(person-needs person32 food)
	(person-needs person32 medicine)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 medicine)
	(person-has person2 food)
	(person-has person2 medicine)
	(person-has person3 medicine)
	(person-has person4 medicine)
	(person-has person5 medicine)
	(person-has person6 food)
	(person-has person6 medicine)
	(person-has person8 medicine)
	(person-has person9 medicine)
	(person-has person10 food)
	(person-has person10 medicine)
	(person-has person11 medicine)
	(person-has person12 medicine)
	(person-has person14 food)
	(person-has person15 food)
	(person-has person15 medicine)
	(person-has person17 medicine)
	(person-has person18 medicine)
	(person-has person19 food)
	(person-has person20 medicine)
	(person-has person21 food)
	(person-has person22 medicine)
	(person-has person23 medicine)
	(person-has person24 food)
	(person-has person25 medicine)
	(person-has person26 medicine)
	(person-has person27 food)
	(person-has person29 medicine)
	(person-has person31 food)
	(person-has person32 food)
	(person-has person32 medicine)
	))
)

; plan
1. (grab-arm1 drone1 crate1 depot)
   deleted: (arm1-free drone1) (at crate1 depot)
   added: (arm1-load drone1 crate1)
   goals met: 1 of 33
2. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 1 of 33
3. (move-drone drone1 depot loc20)
   deleted: (at drone1 depot)
   added: (at drone1 loc20)
   goals met: 0 of 33
4. (deliver-arm2 drone1 person6 crate4 food loc20)
   deleted: (arm2-load drone1 crate4) (person-needs person6 food)
   added: (arm2-free drone1) (person-has person6 food)
   goals met: 1 of 33
5. (move-drone drone1 loc20 depot)
   deleted: (at drone1 loc20)
   added: (at drone1 depot)
   goals met: 2 of 33
6. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 2 of 33
7. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 1 of 33
8. (move-drone drone1 loc17 loc27)
   deleted: (at drone1 loc17)
   added: (at drone1 loc27)
   goals met: 1 of 33
9. (deliver-arm2 drone1 person10 crate3 food loc27)
   deleted: (arm2-load drone1 crate3) (person-needs person10 food)
   added: (arm2-free drone1) (person-has person10 food)
   goals met: 2 of 33
10. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 3 of 33
11. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 3 of 33
12. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 2 of 33
13. (deliver-arm2 drone1 person14 crate2 food loc13)
   deleted: (arm2-load drone1 crate2) (person-needs person14 food)
   added: (arm2-free drone1) (person-has person14 food)
   goals met: 3 of 33
14. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 4 of 33
15. (grab-arm2 drone1 crate6 depot)
   deleted: (arm2-free drone1) (at crate6 depot)
   added: (arm2-load drone1 crate6)
   goals met: 4 of 33
16. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 3 of 33
17. (deliver-arm2 drone1 person15 crate6 food loc22)
   deleted: (arm2-load drone1 crate6) (person-needs person15 food)
   added: (arm2-free drone1) (person-has person15 food)
   goals met: 4 of 33
18. (move-drone drone1 loc22 depot)
   deleted: (at drone1 loc22)
   added: (at drone1 depot)
   goals met: 5 of 33
19. (grab-arm2 drone1 crate5 depot)
   deleted: (arm2-free drone1) (at crate5 depot)
   added: (arm2-load drone1 crate5)
   goals met: 5 of 33
20. (move-drone drone1 depot loc28)
   deleted: (at drone1 depot)
   added: (at drone1 loc28)
   goals met: 4 of 33
21. (move-drone drone1 loc28 loc24)
   deleted: (at drone1 loc28)
   added: (at drone1 loc24)
   goals met: 4 of 33
22. (deliver-arm2 drone1 person19 crate5 food loc24)
   deleted: (arm2-load drone1 crate5) (person-needs person19 food)
   added: (arm2-free drone1) (person-has person19 food)
   goals met: 5 of 33
23. (move-drone drone1 loc24 depot)
   deleted: (at drone1 loc24)
   added: (at drone1 depot)
   goals met: 6 of 33
24. (grab-arm2 drone1 crate7 depot)
   deleted: (arm2-free drone1) (at crate7 depot)
   added: (arm2-load drone1 crate7)
   goals met: 6 of 33
25. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 5 of 33
26. (deliver-arm2 drone1 person21 crate7 food loc10)
   deleted: (arm2-load drone1 crate7) (person-needs person21 food)
   added: (arm2-free drone1) (person-has person21 food)
   goals met: 6 of 33
27. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 7 of 33
28. (grab-arm2 drone1 crate8 depot)
   deleted: (arm2-free drone1) (at crate8 depot)
   added: (arm2-load drone1 crate8)
   goals met: 7 of 33
29. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 6 of 33
30. (deliver-arm2 drone1 person24 crate8 food loc3)
   deleted: (arm2-load drone1 crate8) (person-needs person24 food)
   added: (arm2-free drone1) (person-has person24 food)
   goals met: 7 of 33
31. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 8 of 33
32. (grab-arm2 drone1 crate10 depot)
   deleted: (arm2-free drone1) (at crate10 depot)
   added: (arm2-load drone1 crate10)
   goals met: 8 of 33
33. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 7 of 33
34. (deliver-arm2 drone1 person27 crate10 food loc19)
   deleted: (arm2-load drone1 crate10) (person-needs person27 food)
   added: (arm2-free drone1) (person-has person27 food)
   goals met: 8 of 33
35. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 9 of 33
36. (grab-arm2 drone1 crate11 depot)
   deleted: (arm2-free drone1) (at crate11 depot)
   added: (arm2-load drone1 crate11)
   goals met: 9 of 33
37. (move-drone drone1 depot loc31)
   deleted: (at drone1 depot)
   added: (at drone1 loc31)
   goals met: 8 of 33
38. (deliver-arm2 drone1 person31 crate11 food loc31)
   deleted: (arm2-load drone1 crate11) (person-needs person31 food)
   added: (arm2-free drone1) (person-has person31 food)
   goals met: 9 of 33
39. (move-drone drone1 loc31 depot)
   deleted: (at drone1 loc31)
   added: (at drone1 depot)
   goals met: 10 of 33
40. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 10 of 33
41. (move-drone drone1 depot loc2)
   deleted: (at drone1 depot)
   added: (at drone1 loc2)
   goals met: 9 of 33
42. (deliver-arm2 drone1 person32 crate9 food loc2)
   deleted: (arm2-load drone1 crate9) (person-needs person32 food)
   added: (arm2-free drone1) (person-has person32 food)
   goals met: 10 of 33
43. (move-drone drone1 loc2 loc20)
   deleted: (at drone1 loc2)
   added: (at drone1 loc20)
   goals met: 10 of 33
44. (move-drone drone1 loc20 depot)
   deleted: (at drone1 loc20)
   added: (at drone1 depot)
   goals met: 11 of 33
45. (grab-arm2 drone1 crate23 depot)
   deleted: (arm2-free drone1) (at crate23 depot)
   added: (arm2-load drone1 crate23)
   goals met: 11 of 33
46. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 10 of 33
47. (deliver-arm1 drone1 person2 crate1 food loc9)
   deleted: (arm1-load drone1 crate1) (person-needs person2 food)
   added: (arm1-free drone1) (person-has person2 food)
   goals met: 11 of 33
48. (move-drone drone1 loc9 loc27)
   deleted: (at drone1 loc9)
   added: (at drone1 loc27)
   goals met: 11 of 33
49. (deliver-arm2 drone1 person10 crate23 medicine loc27)
   deleted: (arm2-load drone1 crate23) (person-needs person10 medicine)
   added: (arm2-free drone1) (person-has person10 medicine)
   goals met: 12 of 33
50. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 13 of 33
51. (grab-arm2 drone1 crate12 depot)
   deleted: (arm2-free drone1) (at crate12 depot)
   added: (arm2-load drone1 crate12)
   goals met: 13 of 33
52. (grab-arm1 drone1 crate31 depot)
   deleted: (arm1-free drone1) (at crate31 depot)
   added: (arm1-load drone1 crate31)
   goals met: 13 of 33
53. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 12 of 33
54. (move-drone drone1 loc19 loc18)
   deleted: (at drone1 loc19)
   added: (at drone1 loc18)
   goals met: 12 of 33
55. (deliver-arm2 drone1 person11 crate12 medicine loc18)
   deleted: (arm2-load drone1 crate12) (person-needs person11 medicine)
   added: (arm2-free drone1) (person-has person11 medicine)
   goals met: 13 of 33
56. (move-drone drone1 loc18 loc29)
   deleted: (at drone1 loc18)
   added: (at drone1 loc29)
   goals met: 13 of 33
57. (deliver-arm1 drone1 person12 crate31 medicine loc29)
   deleted: (arm1-load drone1 crate31) (person-needs person12 medicine)
   added: (arm1-free drone1) (person-has person12 medicine)
   goals met: 14 of 33
58. (move-drone drone1 loc29 depot)
   deleted: (at drone1 loc29)
   added: (at drone1 depot)
   goals met: 15 of 33
59. (grab-arm1 drone1 crate30 depot)
   deleted: (arm1-free drone1) (at crate30 depot)
   added: (arm1-load drone1 crate30)
   goals met: 15 of 33
60. (grab-arm2 drone1 crate32 depot)
   deleted: (arm2-free drone1) (at crate32 depot)
   added: (arm2-load drone1 crate32)
   goals met: 15 of 33
61. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 14 of 33
62. (deliver-arm1 drone1 person2 crate30 medicine loc9)
   deleted: (arm1-load drone1 crate30) (person-needs person2 medicine)
   added: (arm1-free drone1) (person-has person2 medicine)
   goals met: 15 of 33
63. (move-drone drone1 loc9 loc5)
   deleted: (at drone1 loc9)
   added: (at drone1 loc5)
   goals met: 15 of 33
64. (deliver-arm2 drone1 person3 crate32 medicine loc5)
   deleted: (arm2-load drone1 crate32) (person-needs person3 medicine)
   added: (arm2-free drone1) (person-has person3 medicine)
   goals met: 16 of 33
65. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 17 of 33
66. (grab-arm2 drone1 crate19 depot)
   deleted: (arm2-free drone1) (at crate19 depot)
   added: (arm2-load drone1 crate19)
   goals met: 17 of 33
67. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 16 of 33
68. (deliver-arm2 drone1 person15 crate19 medicine loc22)
   deleted: (arm2-load drone1 crate19) (person-needs person15 medicine)
   added: (arm2-free drone1) (person-has person15 medicine)
   goals met: 17 of 33
69. (move-drone drone1 loc22 loc25)
   deleted: (at drone1 loc22)
   added: (at drone1 loc25)
   goals met: 17 of 33
70. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 18 of 33
71. (grab-arm2 drone1 crate22 depot)
   deleted: (arm2-free drone1) (at crate22 depot)
   added: (arm2-load drone1 crate22)
   goals met: 18 of 33
72. (grab-arm1 drone1 crate18 depot)
   deleted: (arm1-free drone1) (at crate18 depot)
   added: (arm1-load drone1 crate18)
   goals met: 18 of 33
73. (move-drone drone1 depot loc30)
   deleted: (at drone1 depot)
   added: (at drone1 loc30)
   goals met: 17 of 33
74. (deliver-arm2 drone1 person17 crate22 medicine loc30)
   deleted: (arm2-load drone1 crate22) (person-needs person17 medicine)
   added: (arm2-free drone1) (person-has person17 medicine)
   goals met: 18 of 33
75. (move-drone drone1 loc30 loc14)
   deleted: (at drone1 loc30)
   added: (at drone1 loc14)
   goals met: 18 of 33
76. (deliver-arm1 drone1 person18 crate18 medicine loc14)
   deleted: (arm1-load drone1 crate18) (person-needs person18 medicine)
   added: (arm1-free drone1) (person-has person18 medicine)
   goals met: 19 of 33
77. (move-drone drone1 loc14 depot)
   deleted: (at drone1 loc14)
   added: (at drone1 depot)
   goals met: 20 of 33
78. (grab-arm1 drone1 crate28 depot)
   deleted: (arm1-free drone1) (at crate28 depot)
   added: (arm1-load drone1 crate28)
   goals met: 20 of 33
79. (grab-arm2 drone1 crate27 depot)
   deleted: (arm2-free drone1) (at crate27 depot)
   added: (arm2-load drone1 crate27)
   goals met: 20 of 33
80. (move-drone drone1 depot loc29)
   deleted: (at drone1 depot)
   added: (at drone1 loc29)
   goals met: 19 of 33
81. (deliver-arm1 drone1 person4 crate28 medicine loc29)
   deleted: (arm1-load drone1 crate28) (person-needs person4 medicine)
   added: (arm1-free drone1) (person-has person4 medicine)
   goals met: 20 of 33
82. (move-drone drone1 loc29 loc25)
   deleted: (at drone1 loc29)
   added: (at drone1 loc25)
   goals met: 20 of 33
83. (deliver-arm2 drone1 person20 crate27 medicine loc25)
   deleted: (arm2-load drone1 crate27) (person-needs person20 medicine)
   added: (arm2-free drone1) (person-has person20 medicine)
   goals met: 21 of 33
84. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 22 of 33
85. (grab-arm1 drone1 crate21 depot)
   deleted: (arm1-free drone1) (at crate21 depot)
   added: (arm1-load drone1 crate21)
   goals met: 22 of 33
86. (grab-arm2 drone1 crate26 depot)
   deleted: (arm2-free drone1) (at crate26 depot)
   added: (arm2-load drone1 crate26)
   goals met: 22 of 33
87. (move-drone drone1 depot loc14)
   deleted: (at drone1 depot)
   added: (at drone1 loc14)
   goals met: 21 of 33
88. (move-drone drone1 loc14 loc20)
   deleted: (at drone1 loc14)
   added: (at drone1 loc20)
   goals met: 21 of 33
89. (deliver-arm1 drone1 person5 crate21 medicine loc20)
   deleted: (arm1-load drone1 crate21) (person-needs person5 medicine)
   added: (arm1-free drone1) (person-has person5 medicine)
   goals met: 22 of 33
90. (move-drone drone1 loc20 loc17)
   deleted: (at drone1 loc20)
   added: (at drone1 loc17)
   goals met: 22 of 33
91. (move-drone drone1 loc17 loc14)
   deleted: (at drone1 loc17)
   added: (at drone1 loc14)
   goals met: 22 of 33
92. (move-drone drone1 loc14 loc31)
   deleted: (at drone1 loc14)
   added: (at drone1 loc31)
   goals met: 22 of 33
93. (deliver-arm2 drone1 person22 crate26 medicine loc31)
   deleted: (arm2-load drone1 crate26) (person-needs person22 medicine)
   added: (arm2-free drone1) (person-has person22 medicine)
   goals met: 23 of 33
94. (move-drone drone1 loc31 depot)
   deleted: (at drone1 loc31)
   added: (at drone1 depot)
   goals met: 24 of 33
95. (grab-arm1 drone1 crate20 depot)
   deleted: (arm1-free drone1) (at crate20 depot)
   added: (arm1-load drone1 crate20)
   goals met: 24 of 33
96. (grab-arm2 drone1 crate25 depot)
   deleted: (arm2-free drone1) (at crate25 depot)
   added: (arm2-load drone1 crate25)
   goals met: 24 of 33
97. (move-drone drone1 depot loc29)
   deleted: (at drone1 depot)
   added: (at drone1 loc29)
   goals met: 23 of 33
98. (deliver-arm1 drone1 person23 crate20 medicine loc29)
   deleted: (arm1-load drone1 crate20) (person-needs person23 medicine)
   added: (arm1-free drone1) (person-has person23 medicine)
   goals met: 24 of 33
99. (move-drone drone1 loc29 loc21)
   deleted: (at drone1 loc29)
   added: (at drone1 loc21)
   goals met: 24 of 33
100. (deliver-arm2 drone1 person1 crate25 medicine loc21)
   deleted: (arm2-load drone1 crate25) (person-needs person1 medicine)
   added: (arm2-free drone1) (person-has person1 medicine)
   goals met: 25 of 33
101. (move-drone drone1 loc21 depot)
   deleted: (at drone1 loc21)
   added: (at drone1 depot)
   goals met: 26 of 33
102. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 26 of 33
103. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 25 of 33
104. (move-drone drone1 loc13 loc5)
   deleted: (at drone1 loc13)
   added: (at drone1 loc5)
   goals met: 25 of 33
105. (deliver-arm1 drone1 person25 crate15 medicine loc5)
   deleted: (arm1-load drone1 crate15) (person-needs person25 medicine)
   added: (arm1-free drone1) (person-has person25 medicine)
   goals met: 26 of 33
106. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 27 of 33
107. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 27 of 33
108. (grab-arm2 drone1 crate29 depot)
   deleted: (arm2-free drone1) (at crate29 depot)
   added: (arm2-load drone1 crate29)
   goals met: 27 of 33
109. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 26 of 33
110. (deliver-arm1 drone1 person26 crate17 medicine loc16)
   deleted: (arm1-load drone1 crate17) (person-needs person26 medicine)
   added: (arm1-free drone1) (person-has person26 medicine)
   goals met: 27 of 33
111. (move-drone drone1 loc16 loc20)
   deleted: (at drone1 loc16)
   added: (at drone1 loc20)
   goals met: 27 of 33
112. (deliver-arm2 drone1 person6 crate29 medicine loc20)
   deleted: (arm2-load drone1 crate29) (person-needs person6 medicine)
   added: (arm2-free drone1) (person-has person6 medicine)
   goals met: 28 of 33
113. (move-drone drone1 loc20 depot)
   deleted: (at drone1 loc20)
   added: (at drone1 depot)
   goals met: 29 of 33
114. (grab-arm1 drone1 crate24 depot)
   deleted: (arm1-free drone1) (at crate24 depot)
   added: (arm1-load drone1 crate24)
   goals met: 29 of 33
115. (move-drone drone1 depot loc29)
   deleted: (at drone1 depot)
   added: (at drone1 loc29)
   goals met: 28 of 33
116. (move-drone drone1 loc29 loc9)
   deleted: (at drone1 loc29)
   added: (at drone1 loc9)
   goals met: 28 of 33
117. (deliver-arm1 drone1 person29 crate24 medicine loc9)
   deleted: (arm1-load drone1 crate24) (person-needs person29 medicine)
   added: (arm1-free drone1) (person-has person29 medicine)
   goals met: 29 of 33
118. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 30 of 33
119. (grab-arm1 drone1 crate13 depot)
   deleted: (arm1-free drone1) (at crate13 depot)
   added: (arm1-load drone1 crate13)
   goals met: 30 of 33
120. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 29 of 33
121. (deliver-arm1 drone1 person8 crate13 medicine loc16)
   deleted: (arm1-load drone1 crate13) (person-needs person8 medicine)
   added: (arm1-free drone1) (person-has person8 medicine)
   goals met: 30 of 33
122. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 31 of 33
123. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 31 of 33
124. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 31 of 33
125. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 30 of 33
126. (deliver-arm1 drone1 person9 crate16 medicine loc16)
   deleted: (arm1-load drone1 crate16) (person-needs person9 medicine)
   added: (arm1-free drone1) (person-has person9 medicine)
   goals met: 31 of 33
127. (move-drone drone1 loc16 loc2)
   deleted: (at drone1 loc16)
   added: (at drone1 loc2)
   goals met: 31 of 33
128. (deliver-arm2 drone1 person32 crate14 medicine loc2)
   deleted: (arm2-load drone1 crate14) (person-needs person32 medicine)
   added: (arm2-free drone1) (person-has person32 medicine)
   goals met: 32 of 33
129. (move-drone drone1 loc2 depot)
   deleted: (at drone1 loc2)
   added: (at drone1 depot)
   goals met: 33 of 33
